## DATAFRAME

Datafarme is the main object in pandas where we form the data in the tabular form(excel spreadsheets)

In [ ]:
import pandas as pd
df=pd.read_csv("C:\\Users\\91917\\OneDrive\\Desktop\\people-100.csv")
df

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
1,2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
2,3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
3,4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
4,5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon
...,...,...,...,...,...,...,...,...,...
95,96,5eFda7caAeB260E,Dennis,Barnes,Female,bmartin@example.org,001-095-524-2112x257,1954-07-30,Software engineer
96,97,CCbFce93d3720bE,Steve,Patterson,Female,latasha46@example.net,001-865-478-5157,1932-04-29,Barrister
97,98,2fEc528aFAF0b69,Wesley,Bray,Male,regina11@example.org,995-542-3004x76800,1994-12-28,Police officer
98,99,Adc7ad9B6e4A1Fe,Summer,Oconnell,Female,alexiscantrell@example.org,001-273-685-6932x092,2012-04-12,Broadcast journalist
99,100,b8D0aD3490FC7e1,Mariah,Bernard,Male,pcopeland@example.org,(341)594-6554x44657,2016-11-15,IT sales professional

In [32]:
df[2:11]

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
2,3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
3,4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
4,5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon
5,6,bfDD7CDEF5D865B,Erin,Day,Male,tconner@example.org,001-171-649-9856x5553,2015-10-28,Waste management officer
6,7,bE9EEf34cB72AF7,Katherine,Buck,Female,conniecowan@example.com,+1-773-151-6685x49162,1989-01-22,Intelligence analyst
7,8,2EFC6A4e77FaEaC,Ricardo,Hinton,Male,wyattbishop@example.com,001-447-699-7998x88612,1924-03-26,Hydrogeologist
8,9,baDcC4DeefD8dEB,Dave,Farrell,Male,nmccann@example.net,603-428-2429x27392,2018-10-06,Lawyer
9,10,8e4FB470FE19bF0,Isaiah,Downs,Male,virginiaterrell@example.org,+1-511-372-1544x8206,1964-09-20,"Engineer, site"
10,11,BF0BbA03C29Bb3b,Sheila,Ross,Female,huangcathy@example.com,895.881.4746,2008-03-20,Advertising account executive

In [33]:
df.columns

Index(['Index', 'User Id', 'First Name', 'Last Name', 'Sex', 'Email', 'Phone',
       'Date of birth', 'Job Title'],
      dtype='object')

In [ ]:
df.Email # df["Email"](same)

0           elijah57@example.net
1          bethany14@example.com
2          bthompson@example.com
3      kaitlinkaiser@example.com
4     buchananmanuel@example.net
                 ...
95           bmartin@example.org
96         latasha46@example.net
97          regina11@example.org
98    alexiscantrell@example.org
99         pcopeland@example.org
Name: Email, Length: 100, dtype: object

In [12]:
df1=pd.read_csv("C:\\Users\\91917\\OneDrive\\Desktop\\jupyter notebook\\jupyter_nb_numpy\\PANDAS\\school.csv")
df1

   id    name    cource  age
0   1  Anjali  AI &  DS   21
1   2  Ritesh        CS   31
2   3    Yash        CS   18

In [13]:
df1["name"]

0    Anjali
1    Ritesh
2      Yash
Name: name, dtype: object

In [24]:
dict1={
    "Name":["Anjali","Ritesh"],
    "id":[11,24],
    "cource":["AI & DS","CS"]
}
print(dict1)
df2=pd.DataFrame(dict1)
df2

{'Name': ['Anjali', 'Ritesh'], 'id': [11, 24], 'cource': ['AI & DS', 'CS']}

     Name  id   cource
0  Anjali  11  AI & DS
1  Ritesh  24       CS

In [28]:
df2.shape

(2, 3)

In [ ]:
row,column=df2.shape
row

2

In [42]:
df1[df1["age"]>30]

   id    name cource  age
1   2  Ritesh     CS   31

In [ ]:
df1[df1.age<22]

   id    name    cource  age
0   1  Anjali  AI &  DS   21
2   3    Yash        CS   18

In [47]:
df1[df1.age==df1["age"].max()]

   id    name cource  age
1   2  Ritesh     CS   31

In [50]:
df1.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
df1.set_index("id",inplace=True)
# inpalce modify the set index as id

In [53]:
df1

      name    cource  age
id
1   Anjali  AI &  DS   21
2   Ritesh        CS   31
3     Yash        CS   18

In [57]:
df1.loc[2]

name      Ritesh
cource        CS
age           31
Name: 2, dtype: object

In [60]:
df1.reset_index(inplace=True)
df1

   id    name    cource  age
0   1  Anjali  AI &  DS   21
1   2  Ritesh        CS   31
2   3    Yash        CS   18